# Setup

In [142]:
import pandas as pd
import numpy as np
import datetime

In [143]:
def start_time():
    return datetime.datetime.now()


def end_time(start_time, get_time=False, name_to_announce='', print_time=True):
    end_time = datetime.datetime.now()
    execution_time = end_time - start_time
    
    result = name_to_announce != ""
    
#    print(result)
    
    if print_time: print([f"{execution_time.total_seconds() * 1000} miliseconds or {execution_time.total_seconds()} seconds", f"{execution_time.total_seconds() * 1000} miliseconds or {execution_time.total_seconds()} seconds for {name_to_announce}"][name_to_announce != ""])
    if get_time: return execution_time

def compare_df_time_and_nar_time(list_for_dfs_time, list_for_ars_time, get_compare=False, hard_compare=True):
    if hard_compare:
        df_time = np.average(list_for_dfs_time)
        nar_time = np.average(list_for_ars_time)
        compare = abs(df_time.total_seconds()-nar_time.total_seconds())

        #df_time_med = np.median(list_for_dfs_time)
        #nar_time_med = np.median(list_for_ars_time)
        #avrg_med = np.average([df_time_med.total_seconds(), nar_time_med.total_seconds()])
        
        df_time_med = np.max(list_for_dfs_time)
        nar_time_med = np.max(list_for_ars_time)
        avrg_med = np.average(abs(df_time_med.total_seconds() - nar_time_med.total_seconds()))
        
        print(f"Compare: {compare} seconds , while our best is: {avrg_med * 0.1} seconds and our worst is: {avrg_med * 1.0} seconds")

        #print(compare >= 0.5, compare >= 0.025, compare >= 0.00125, compare >= 0.000625, compare == 0)

        if compare < avrg_med * 0.1: mark = 5
        elif compare < avrg_med * 0.3: mark = 4
        elif compare < avrg_med * 0.6: mark = 3
        elif compare < avrg_med * 0.8: mark = 2
        elif compare < avrg_med * 1.0: mark = 1
        else: mark = 0
    else:
        df_time = list_for_dfs_time
        nar_time = list_for_ars_time
        compare = abs(df_time.total_seconds()-nar_time.total_seconds())
    if df_time>nar_time: print(f'time for nar is faster for {compare} seconds')
    elif df_time==nar_time: print("They are equal")
    else: print(f'time for df is faster for {compare} seconds')
    if hard_compare: print(f"My mark is {mark}")
    
    if get_compare: return compare

***
# Завдання першого рівня
Виконати всі завдання, використовуючи як numpy array, так і dataframe, проаналізувати часові витрати на виконання процедур (профілювання часу виконання), зробити висновки щодо ситуацій, в яких має сенс віддати перевагу тій чи іншій структурі даних. Висновки оформити звітом із зазначеним часом виконання та оцінкою по 5-бальній шкалі зручності виконання операцій відбору).

## Reading and Dropping

In [144]:
dictionary_for_needed_type = {
    'Global_active_power': 'float64',
    'Global_reactive_power': 'float64',
    'Voltage': 'float64',
    'Global_intensity': 'float64',
    'Sub_metering_1': 'float64',
    'Sub_metering_2': 'float64',
    'Sub_metering_3': 'float64',
                             }

In [145]:
df = pd.read_csv("household_power_consumption.txt", sep=";", low_memory=False)
nar = df.values

In [146]:
nar

array([['16/12/2006', '17:24:00', '4.216', ..., '0.000', '1.000', 17.0],
       ['16/12/2006', '17:25:00', '5.360', ..., '0.000', '1.000', 16.0],
       ['16/12/2006', '17:26:00', '5.374', ..., '0.000', '2.000', 17.0],
       ...,
       ['26/11/2010', '21:00:00', '0.938', ..., '0.000', '0.000', 0.0],
       ['26/11/2010', '21:01:00', '0.934', ..., '0.000', '0.000', 0.0],
       ['26/11/2010', '21:02:00', '0.932', ..., '0.000', '0.000', 0.0]],
      dtype=object)

In [147]:
time = start_time()

df.replace('?', pd.NA, inplace=True)
df.dropna(inplace=True)

df_time = end_time(time, True, "df")

time = start_time()

nar = np.delete(nar, np.where(nar == '?'), 0)

nar_time = end_time(time, True, "nar")

compare_df_time_and_nar_time(df_time, nar_time, hard_compare=False)

1413.033 miliseconds or 1.413033 seconds for df
473.011 miliseconds or 0.473011 seconds for nar
time for nar is faster for 0.9400219999999999 seconds

In [148]:
nar

array([['16/12/2006', '17:24:00', '4.216', ..., '0.000', '1.000', 17.0],
       ['16/12/2006', '17:25:00', '5.360', ..., '0.000', '1.000', 16.0],
       ['16/12/2006', '17:32:00', '3.668', ..., '0.000', '1.000', 17.0],
       ...,
       ['26/11/2010', '21:00:00', '0.938', ..., '0.000', '0.000', 0.0],
       ['26/11/2010', '21:01:00', '0.934', ..., '0.000', '0.000', 0.0],
       ['26/11/2010', '21:02:00', '0.932', ..., '0.000', '0.000', 0.0]],
      dtype=object)

In [149]:
time = start_time()

df = df.astype(dictionary_for_needed_type)

df_time = end_time(time, True, "df")

time = start_time()

ar = np.concatenate((nar[:, [0, 1]], nar[:, [2, 3, 4, 5]].astype(float), nar[:, [6, 7, 8]].astype(float).astype(int)), axis=1)

ar_time = end_time(time, True, "ar")
compare_df_time_and_nar_time(df_time, ar_time, hard_compare=False)

2038.058 miliseconds or 2.038058 seconds for df
2471.066 miliseconds or 2.471066 seconds for ar
time for df is faster for 0.43300800000000006 seconds

## 1. Обрати всі домогосподарства, у яких загальна активна споживана потужність перевищує 5 кВт.

In [150]:
list_for_df_time = []
list_for_ar_time = []

for _ in range(100):
    time = start_time()

    df_first = df[df["Global_active_power"]>5][["Date", "Time", 'Global_active_power', 'Sub_metering_1', 'Sub_metering_2', 'Sub_metering_3']]
    df_time = end_time(time, True, "df", False)
    list_for_df_time.append(df_time)
    
    time = start_time()

    ar_first = ar[ar[..., 2]>5]
    ar_time = end_time(time, True, "ar", False)
    list_for_ar_time.append(ar_time)

compare_df_time_and_nar_time(list_for_df_time, list_for_ar_time)

Compare: 0.052733 seconds , while our best is: 0.005499700000000001 seconds and our worst is: 0.054997000000000004 seconds
time for df is faster for 0.052733 seconds
My mark is 1

In [151]:
df_first

,Date,Time,Global_active_power,Sub_metering_1,Sub_metering_2,Sub_metering_3
1,16/12/2006,17:25:00,5.360,0.0,1.0,16.0
2,16/12/2006,17:26:00,5.374,0.0,2.0,17.0
3,16/12/2006,17:27:00,5.388,0.0,1.0,17.0
11,16/12/2006,17:35:00,5.412,0.0,1.0,17.0
12,16/12/2006,17:36:00,5.224,0.0,1.0,16.0
...,...,...,...,...,...,...
2069356,22/11/2010,18:40:00,5.408,48.0,0.0,0.0
2069357,22/11/2010,18:41:00,5.528,53.0,0.0,0.0
2071586,24/11/2010,07:50:00,5.172,0.0,38.0,17.0
2071587,24/11/2010,07:51:00,5.750,0.0,39.0,17.0
2072997,25/11/2010,07:21:00,5.074,1.0,2.0,18.0

In [152]:
pd.DataFrame.from_records(ar_first)[[0, 1, 2, 6, 7, 8]]

                0         1      2   6   7   8
0      16/12/2006  17:25:00  5.360   0   1  16
1      16/12/2006  17:35:00  5.412   0   1  17
2      16/12/2006  17:36:00  5.224   0   1  16
3      16/12/2006  17:37:00  5.268   0   2  17
4      16/12/2006  17:44:00  5.894   0   0  16
...           ...       ...    ...  ..  ..  ..
17540  22/11/2010  18:40:00  5.408  48   0   0
17541  22/11/2010  18:41:00  5.528  53   0   0
17542  24/11/2010  07:50:00  5.172   0  38  17
17543  24/11/2010  07:51:00  5.750   0  39  17
17544  25/11/2010  07:21:00  5.074   1   2  18

[17545 rows x 6 columns]

## 2. Обрати всі домогосподарства, у яких вольтаж перевищую 235 В.

In [153]:
list_for_df_time = []
list_for_ar_time = []

for _ in range(100):
    time = start_time()

    df_second = df[df["Voltage"]>235][["Date", "Time", 'Voltage', 'Sub_metering_1', 'Sub_metering_2', 'Sub_metering_3']]

    df_time = end_time(time, True, "ar", False)
    list_for_df_time.append(df_time)
    
    time = start_time()

    ar_second = ar[ar[..., 4]>235]
    ar_time = end_time(time, True, "ar", False)
    list_for_ar_time.append(ar_time)

compare_df_time_and_nar_time(list_for_df_time, list_for_ar_time)

Compare: 0.008855000000000002 seconds , while our best is: 0.005300200000000002 seconds and our worst is: 0.05300200000000002 seconds
time for nar is faster for 0.008855000000000002 seconds
My mark is 4

In [154]:
df_second

,Date,Time,Voltage,Sub_metering_1,Sub_metering_2,Sub_metering_3
4,16/12/2006,17:28:00,235.68,0.0,1.0,17.0
5,16/12/2006,17:29:00,235.02,0.0,2.0,17.0
6,16/12/2006,17:30:00,235.09,0.0,1.0,17.0
7,16/12/2006,17:31:00,235.22,0.0,1.0,17.0
14,16/12/2006,17:38:00,235.24,0.0,1.0,17.0
...,...,...,...,...,...,...
2075254,26/11/2010,20:58:00,240.43,0.0,0.0,0.0
2075255,26/11/2010,20:59:00,240.00,0.0,0.0,0.0
2075256,26/11/2010,21:00:00,239.82,0.0,0.0,0.0
2075257,26/11/2010,21:01:00,239.70,0.0,0.0,0.0
2075258,26/11/2010,21:02:00,239.55,0.0,0.0,0.0

In [155]:
pd.DataFrame.from_records(ar_second)[[0, 1, 4, 6, 7, 8]]

                  0         1       4  6  7   8
0        16/12/2006  17:38:00  235.24  0  1  17
1        16/12/2006  17:39:00  237.14  0  0  17
2        16/12/2006  17:40:00  236.73  0  0  17
3        16/12/2006  17:41:00  237.06  0  0  17
4        16/12/2006  17:42:00  237.13  0  0  18
...             ...       ...     ... .. ..  ..
1952482  26/11/2010  20:58:00  240.43  0  0   0
1952483  26/11/2010  20:59:00  240.00  0  0   0
1952484  26/11/2010  21:00:00  239.82  0  0   0
1952485  26/11/2010  21:01:00  239.70  0  0   0
1952486  26/11/2010  21:02:00  239.55  0  0   0

[1952487 rows x 6 columns]

## 3. Обрати всі домогосподарства, у яких сила струму лежить в межах 19-20 А, для них виявити ті, у яких пральна машина та холодильних споживають більше, ніж бойлер та кондиціонер.

In [156]:
pd.DataFrame.from_records(ar)

                  0         1      2      3       4     5  6  7   8
0        16/12/2006  17:24:00  4.216  0.418  234.84  18.4  0  1  17
1        16/12/2006  17:25:00  5.360  0.436  233.63  23.0  0  1  16
2        16/12/2006  17:32:00  3.668  0.510  233.99  15.8  0  1  17
3        16/12/2006  17:33:00  3.662  0.510  233.86  15.8  0  2  16
4        16/12/2006  17:34:00  4.448  0.498  232.86  19.6  0  1  17
...             ...       ...    ...    ...     ...   ... .. ..  ..
2049269  26/11/2010  20:58:00  0.946  0.000  240.43   4.0  0  0   0
2049270  26/11/2010  20:59:00  0.944  0.000  240.00   4.0  0  0   0
2049271  26/11/2010  21:00:00  0.938  0.000  239.82   3.8  0  0   0
2049272  26/11/2010  21:01:00  0.934  0.000  239.70   3.8  0  0   0
2049273  26/11/2010  21:02:00  0.932  0.000  239.55   3.8  0  0   0

[2049274 rows x 9 columns]

In [157]:
list_for_df_time = []
list_for_ar_time = []

for _ in range(100):
    time = start_time()

    df_third = df[(df["Global_intensity"] >= 19) & (df["Global_intensity"] <= 20) & (df["Sub_metering_2"] > df["Sub_metering_3"])][["Date", "Time", 'Global_intensity', 'Sub_metering_1', 'Sub_metering_2', 'Sub_metering_3']]
    
    df_time = end_time(time, True, "ar", False)
    list_for_df_time.append(df_time)
    
    time = start_time()

    ar_third = ar[(ar[..., 5]>=19) & (ar[..., 5]<=20) & (ar[..., 7]>ar[..., 8])]
    
    ar_time = end_time(time, True, "ar", False)
    list_for_ar_time.append(ar_time)

compare_df_time_and_nar_time(list_for_df_time, list_for_ar_time)

Compare: 0.132902 seconds , while our best is: 0.0174996 seconds and our worst is: 0.174996 seconds
time for df is faster for 0.132902 seconds
My mark is 2

In [158]:
df_third

,Date,Time,Global_intensity,Sub_metering_1,Sub_metering_2,Sub_metering_3
45,16/12/2006,18:09:00,19.0,0.0,37.0,16.0
460,17/12/2006,01:04:00,19.6,0.0,13.0,0.0
464,17/12/2006,01:08:00,19.6,0.0,27.0,0.0
475,17/12/2006,01:19:00,19.4,0.0,36.0,0.0
476,17/12/2006,01:20:00,19.4,0.0,35.0,0.0
...,...,...,...,...,...,...
2071589,24/11/2010,07:53:00,19.8,0.0,39.0,17.0
2071590,24/11/2010,07:54:00,19.8,0.0,39.0,18.0
2071591,24/11/2010,07:55:00,19.4,0.0,40.0,17.0
2071592,24/11/2010,07:56:00,19.0,0.0,39.0,17.0
2071593,24/11/2010,07:57:00,19.4,0.0,39.0,17.0

In [159]:
ar_third

array([['16/12/2006', '18:09:00', 4.464, ..., 0, 37, 16],
       ['17/12/2006', '01:04:00', 4.582, ..., 0, 13, 0],
       ['17/12/2006', '01:08:00', 4.618, ..., 0, 27, 0],
       ...,
       ['24/11/2010', '07:55:00', 4.602, ..., 0, 40, 17],
       ['24/11/2010', '07:56:00', 4.536, ..., 0, 39, 17],
       ['24/11/2010', '07:57:00', 4.626, ..., 0, 39, 17]], dtype=object)

## 4. Обрати випадковим чином 500000 домогосподарств (без повторів елементів вибірки), для них обчислити середні величини усіх 3-х груп споживання електричної енергії, а також

In [160]:
list_for_df_time = []
list_for_ar_time = []

random_df = df.sample(500000)
random_ar = random_df.values

for _ in range(10):
    time = start_time()

    random_df['Average_of_3'] = (random_df['Sub_metering_1']+random_df['Sub_metering_2']+random_df['Sub_metering_3'])/3
    df_fourth = random_df[["Date", "Time", 'Average_of_3', 'Sub_metering_1', 'Sub_metering_2', 'Sub_metering_3']]
    
    df_time = end_time(time, True, "ar", False)
    list_for_df_time.append(df_time)
    
    time = start_time()
    
    a = np.average(random_ar[..., [6, 7, 8]], axis=1)
    ar_fourth = np.column_stack((random_ar[:, [0, 1, 6, 7, 8]], a.reshape(a.size, 1)))
    
    ar_time = end_time(time, True, "ar", False)
    list_for_ar_time.append(ar_time)

compare_df_time_and_nar_time(list_for_df_time, list_for_ar_time)

Compare: 0.081706 seconds , while our best is: 0.009400400000000001 seconds and our worst is: 0.094004 seconds
time for df is faster for 0.081706 seconds
My mark is 1

In [161]:
df_fourth

,Date,Time,Average_of_3,Sub_metering_1,Sub_metering_2,Sub_metering_3
301516,14/7/2007,02:40:00,0.000000,0.0,0.0,0.0
186667,25/4/2007,08:31:00,5.666667,0.0,0.0,17.0
1702142,12/3/2010,18:26:00,0.000000,0.0,0.0,0.0
309588,19/7/2007,17:12:00,0.000000,0.0,0.0,0.0
1183918,17/3/2009,21:22:00,11.000000,0.0,16.0,17.0
...,...,...,...,...,...,...
824844,11/7/2008,12:48:00,6.000000,0.0,0.0,18.0
247381,6/6/2007,12:25:00,0.666667,0.0,2.0,0.0
958749,12/10/2008,12:33:00,0.333333,0.0,0.0,1.0
1032382,2/12/2008,15:46:00,0.333333,0.0,1.0,0.0
966563,17/10/2008,22:47:00,0.000000,0.0,0.0,0.0

In [162]:
ar_fourth

array([['14/7/2007', '02:40:00', 0.0, 0.0, 0.0, 0.0],
       ['25/4/2007', '08:31:00', 0.0, 0.0, 17.0, 5.666666666666667],
       ['12/3/2010', '18:26:00', 0.0, 0.0, 0.0, 0.0],
       ...,
       ['12/10/2008', '12:33:00', 0.0, 0.0, 1.0, 0.3333333333333333],
       ['2/12/2008', '15:46:00', 0.0, 1.0, 0.0, 0.3333333333333333],
       ['17/10/2008', '22:47:00', 0.0, 0.0, 0.0, 0.0]], dtype=object)

## 5. Обрати ті домогосподарства, які після 18-00 споживають понад 6 кВт за хвилину в середньому, серед відібраних визначити ті, у яких основне споживання електроенергії у вказаний проміжок часу припадає на пральну машину, сушарку, холодильник та освітлення (група 2 є найбільшою), а потім обрати кожен третій результат із першої половини та кожен четвертий результат із другої половини.

In [163]:
pd.DataFrame.from_records(ar)

                  0         1      2      3       4     5  6  7   8
0        16/12/2006  17:24:00  4.216  0.418  234.84  18.4  0  1  17
1        16/12/2006  17:25:00  5.360  0.436  233.63  23.0  0  1  16
2        16/12/2006  17:32:00  3.668  0.510  233.99  15.8  0  1  17
3        16/12/2006  17:33:00  3.662  0.510  233.86  15.8  0  2  16
4        16/12/2006  17:34:00  4.448  0.498  232.86  19.6  0  1  17
...             ...       ...    ...    ...     ...   ... .. ..  ..
2049269  26/11/2010  20:58:00  0.946  0.000  240.43   4.0  0  0   0
2049270  26/11/2010  20:59:00  0.944  0.000  240.00   4.0  0  0   0
2049271  26/11/2010  21:00:00  0.938  0.000  239.82   3.8  0  0   0
2049272  26/11/2010  21:01:00  0.934  0.000  239.70   3.8  0  0   0
2049273  26/11/2010  21:02:00  0.932  0.000  239.55   3.8  0  0   0

[2049274 rows x 9 columns]

In [164]:
# start_time = np.datetime64('now', 'ms')
list_for_df_time = []
list_for_ar_time = []

for _ in range(10):
    time = start_time()

    fifth_df = df[(df['Time']>= "18:30:00") & (df['Global_active_power']>6) & (df["Sub_metering_2"]>df["Sub_metering_1"]) & (df["Sub_metering_2"]>df["Sub_metering_3"])]
    # fifth_df
    order = []
    for i in range(0, len(fifth_df)//2, 3):
        order.append(fifth_df.iloc[i])
    for i in range(len(fifth_df)//2, len(fifth_df), 4):
        order.append(fifth_df.iloc[i])
    # end_time = np.datetime64('now', 'ms')
    df_fifth = pd.DataFrame.from_records(order)
    # print(df_fifth)
    
    df_time = end_time(time, True, "ar", False)
    list_for_df_time.append(df_time)
    
    time = start_time()
    
    ar_fifth = ar[(ar[..., 1]>="18:30:00") & (ar[..., 2]>6) & (ar[..., 7]>ar[..., 8])& (ar[..., 7]>ar[..., 6])]
    
    ar_time = end_time(time, True, "ar", False)
    list_for_ar_time.append(ar_time)

compare_df_time_and_nar_time(list_for_df_time, list_for_ar_time)

Compare: 0.003699000000000008 seconds , while our best is: 0.0002002000000000004 seconds and our worst is: 0.0020020000000000038 seconds
time for df is faster for 0.003699000000000008 seconds
My mark is 0

In [165]:
df_fifth

,Date,Time,Global_active_power,Global_reactive_power,Voltage,Global_intensity,Sub_metering_1,Sub_metering_2,Sub_metering_3
0,16/12/2006,18:35:00,6.072,0.000,232.48,26.4,0.0,27.0,17.0
1,28/12/2006,21:00:00,6.376,0.252,235.94,27.4,1.0,53.0,17.0
2,28/12/2006,21:03:00,7.906,0.286,235.93,33.6,1.0,73.0,17.0
3,28/12/2006,21:06:00,7.184,0.000,235.70,30.4,2.0,73.0,17.0
4,28/12/2006,21:09:00,7.210,0.000,236.14,30.4,1.0,73.0,17.0
...,...,...,...,...,...,...,...,...,...
273,20/11/2010,18:30:00,6.620,0.314,229.00,29.2,18.0,34.0,16.0
274,20/11/2010,18:34:00,6.266,0.360,229.82,27.6,14.0,35.0,16.0
275,20/11/2010,18:38:00,6.302,0.376,229.65,27.8,15.0,34.0,17.0
276,20/11/2010,18:42:00,6.238,0.344,229.37,27.6,14.0,35.0,16.0
277,20/11/2010,18:46:00,6.438,0.308,229.26,28.4,13.0,39.0,16.0

In [166]:
ar_fifth

array([['16/12/2006', '18:35:00', 6.072, ..., 0, 27, 17],
       ['18/12/2006', '19:31:00', 6.158, ..., 0, 36, 0],
       ['28/12/2006', '20:58:00', 6.386, ..., 1, 36, 17],
       ...,
       ['20/11/2010', '18:46:00', 6.438, ..., 13, 39, 16],
       ['20/11/2010', '18:49:00', 6.21, ..., 21, 34, 17],
       ['20/11/2010', '18:52:00', 6.364, ..., 17, 34, 16]], dtype=object)

***
# *Завдання другого рівня*

Виконати всі завдання, використовуючи як numpy array, так і dataframe

## 1. Поборотися із зниклими даними. Для цього в допомогу вам [Медіум](https://towardsdatascience.com/how-to-handle-missing-data-8646b18db0d4).

## 2. Пронормувати вибраний датасет або стандартизувати його (нормалізація і стандартизація мають бути реалізовані як окремі функції без застосування додаткових бібліотек, як наприклад sklearn.preprocessing).

## 3. Збудувати гістограму по одному із атрибутів, що буде показувати на кількість елементів, що знаходяться у 10 діапазонах, які ви задасте.

## 4. Збудувати графік залежності одного integer/real атрибута від іншого.

## 5. Підрахувати коефіцієнт Пірсона та Спірсона для двох integer/real атрибутів.

## 6. Провести One Hot Encoding категоріального string атрибуту.

## 7. Провести візуалізацію багатовимірних даних, використовуючи приклади, наведені у [медіумі](https://towardsdatascience.com/the-art-of-effective-visualization-of-multi-dimensional-data-6c7202990c57).

***
# *Додаткове завдання*:

## 8. Поділити випадковим чином датасет на дві рівні частини. Навчити 3 регресійні моделі на основі не менше одного атрибуту відновлювати інший. Навчання має відбуватися на основі [першого датасету](https://scikit-learn.org/stable/modules/linear_model.html), візуалізувати моделі та на основі [середньої квадратичної помилки](https://scikit-learn.org/stable/modules/generated/sklearn.metrics.mean_squared_error.html) вибрати найкращу.